In [1]:
import pandas as pd
import numpy as np

In [5]:
student = [[12,23,],
           [45,44],
           [34,67]
           ]

df = pd.DataFrame(student,columns=['Col1','Col2'])
df

   Col1  Col2
0    12    23
1    45    44
2    34    67

In [3]:
pd.Series(student)

0    [12, 23]
1    [45, 44]
2    [34, 67]
dtype: object

In [6]:
df.index= ['a','b','c']

In [7]:
df

   Col1  Col2
a    12    23
b    45    44
c    34    67

In [8]:
student_dicr = {
    'iq' : [100,90,39,80,65,0],
    'marks' : [32,43,54,65,77,87],
    'package' : [10,12,11,8,7,9]
}

df = pd.DataFrame(student_dicr)

In [9]:
df

    iq  marks  package
0  100     32       10
1   90     43       12
2   39     54       11
3   80     65        8
4   65     77        7
5    0     87        9

In [10]:
df = pd.read_csv("TCS.NSE.csv")
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2015-01-01,1283.500000,1283.500000,1270.500000,1272.775024,1114.909302,366830.0
1,2015-01-02,1275.500000,1295.474976,1275.300049,1289.724976,1129.757202,925740.0
2,2015-01-05,1290.500000,1299.949951,1262.324951,1270.125000,1112.587769,1754242.0
3,2015-01-06,1264.550049,1264.550049,1220.000000,1223.300049,1071.570801,2423784.0
4,2015-01-07,1235.000000,1239.574951,1203.724976,1208.849976,1058.912842,2636332.0

In [13]:
df_e = pd.read_excel("series_data.xlsx")
df_e

  Unnamed: 0   0
0          A  10
1          B  20
2          C  30
3          D  40
4          E  50

In [63]:
df = pd.read_csv(r"https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [15]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
df.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], shape=(891, 12), dtype=object)

In [18]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [19]:
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [21]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
518,519,1,2,"Angle, Mrs. William A (Florence ""Mary"" Agnes H...",female,36.0,1,0,226875,26.0000,NaN,S
266,267,0,3,"Panula, Mr. Ernesti Arvid",male,16.0,4,1,3101295,39.6875,NaN,S
758,759,0,3,"Theobald, Mr. Thomas Leonard",male,34.0,0,0,363294,8.0500,NaN,S
396,397,0,3,"Olsson, Miss. Elina",female,31.0,0,0,350407,7.8542,NaN,S
478,479,0,3,"Karlsson, Mr. Nils August",male,22.0,0,0,350060,7.5208,NaN,S

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [23]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [25]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [26]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [27]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [28]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [29]:
df.duplicated().sum()

np.int64(0)

In [30]:
student = [[12,23,],
           [45,44],
           [34,67]
           ]

df1 = pd.DataFrame(student,columns=['Col1','Col2'])
df1

   Col1  Col2
0    12    23
1    45    44
2    34    67

In [31]:
df1.rename(columns={'Col1':'Column1'})

   Column1  Col2
0       12    23
1       45    44
2       34    67

In [32]:
df1.sum()

Col1     91
Col2    134
dtype: int64

In [33]:
df1['Col1'].sum()

np.int64(91)

In [34]:
df1.sum(axis=1)

0     35
1     89
2    101
dtype: int64

In [35]:
df1.sum(axis=0)

Col1     91
Col2    134
dtype: int64

In [36]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [37]:
df['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [38]:
df[['PassengerId','Survived','Pclass']]

     PassengerId  Survived  Pclass
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

[891 rows x 3 columns]

In [39]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [43]:
data = {
    'A':[1,2,3,4,5],
    'B':['a','b','c','d','e']
}

df2 = pd.DataFrame(data)

In [44]:
df2

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e

In [45]:
df2[1:3]

   A  B
1  2  b
2  3  c

In [47]:
df2.iloc[0,1]

'a'

In [48]:
df2.iloc[1:4,:2]

   A  B
1  2  b
2  3  c
3  4  d

In [49]:
df2.iloc[1:4,:1]

   A
1  2
2  3
3  4

In [50]:
df2.iloc[[0,2,4],[0]]

   A
0  1
2  3
4  5

In [51]:
df2.index = ['W','X','Y','Z','V']

In [52]:
df2

   A  B
W  1  a
X  2  b
Y  3  c
Z  4  d
V  5  e

In [53]:
df2.loc['X']

A    2
B    b
Name: X, dtype: object

In [54]:
df2.loc['X','B']

'b'

In [55]:
df2.loc["X":]

   A  B
X  2  b
Y  3  c
Z  4  d
V  5  e

In [57]:
df2.loc["X":"Z","A"]

X    2
Y    3
Z    4
Name: A, dtype: int64

In [58]:
df2.loc["X":"Z","A":"B"]

   A  B
X  2  b
Y  3  c
Z  4  d

In [60]:
df2.loc[["Y"],["A"]]

   A
Y  3

In [61]:
df2.loc[["Y","Z","V"],["A"]]

   A
Y  3
Z  4
V  5

In [76]:
student_dict = {
    'name' : ['Vikas','Muskan', 'Sagar', 'Rahul', 'Sarthak'],
    'iq' : [100,90,80,0,60],
    'marks' : [90,80,70,0,68],
    'package' : [10,9,11,0,12]
}


student1 = pd.DataFrame(student_dict)

In [77]:
student1

      name   iq  marks  package
0    Vikas  100     90       10
1   Muskan   90     80        9
2    Sagar   80     70       11
3    Rahul    0      0        0
4  Sarthak   60     68       12

In [78]:
student1.infer_objects()

      name   iq  marks  package
0    Vikas  100     90       10
1   Muskan   90     80        9
2    Sagar   80     70       11
3    Rahul    0      0        0
4  Sarthak   60     68       12

In [79]:
student1.set_index('name',inplace=True)

In [80]:
student1.loc['Sarthak']

iq         60
marks      68
package    12
Name: Sarthak, dtype: int64

In [81]:
student1.loc[['Sarthak','Vikas']]

          iq  marks  package
name
Sarthak   60     68       12
Vikas    100     90       10

In [82]:
student1.iloc[[0,4]]

          iq  marks  package
name
Vikas    100     90       10
Sarthak   60     68       12

In [83]:
student1.shape

(5, 3)

In [87]:
data = {
    'Name':['Vikas','Muskan', 'Sagar', 'Rahul', 'Sarthak'],
    'Age':[23,30,35,40,45],
    'Gender':['M','F','M','M','M']
}

d = pd.DataFrame(data)

In [88]:
d

      Name  Age Gender
0    Vikas   23      M
1   Muskan   30      F
2    Sagar   35      M
3    Rahul   40      M
4  Sarthak   45      M

In [89]:
d['Age']>30

0    False
1    False
2     True
3     True
4     True
Name: Age, dtype: bool

In [91]:
d[d['Age']>30]

      Name  Age Gender
2    Sagar   35      M
3    Rahul   40      M
4  Sarthak   45      M

In [94]:
d['Gender']=='M'

0     True
1    False
2     True
3     True
4     True
Name: Gender, dtype: bool

In [95]:
d[d['Gender']=='M']

      Name  Age Gender
0    Vikas   23      M
2    Sagar   35      M
3    Rahul   40      M
4  Sarthak   45      M

**Condition on two columns**

In [96]:
d[(d['Gender']=='M')&(d['Age']>30)]

      Name  Age Gender
2    Sagar   35      M
3    Rahul   40      M
4  Sarthak   45      M

In [97]:
d[(d['Gender']=='M')|(d['Age']>30)]

      Name  Age Gender
0    Vikas   23      M
2    Sagar   35      M
3    Rahul   40      M
4  Sarthak   45      M

In [98]:
d['Name'].isin(['Vikas'])

0     True
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [99]:
d[d['Name'].isin(['Vikas'])]

    Name  Age Gender
0  Vikas   23      M

In [103]:
d

      Name  Age Gender
0    Vikas   23      M
1   Muskan   30      F
2    Sagar   35      M
3    Rahul   40      M
4  Sarthak   45      M

In [104]:
type(d)

pandas.core.frame.DataFrame

In [106]:
d['Name'].str.startswith('S')

0    False
1    False
2     True
3    False
4     True
Name: Name, dtype: bool

In [107]:
d[d['Name'].str.startswith('S')]

      Name  Age Gender
2    Sagar   35      M
4  Sarthak   45      M

In [111]:
d.sort_values(by='Age',ascending=False)

      Name  Age Gender
4  Sarthak   45      M
3    Rahul   40      M
2    Sagar   35      M
1   Muskan   30      F
0    Vikas   23      M

In [112]:
d['Marks'] = [90,80,70,89,80]

In [113]:
d

      Name  Age Gender  Marks
0    Vikas   23      M     90
1   Muskan   30      F     80
2    Sagar   35      M     70
3    Rahul   40      M     89
4  Sarthak   45      M     80

In [114]:
d.drop(columns='Marks')

      Name  Age Gender
0    Vikas   23      M
1   Muskan   30      F
2    Sagar   35      M
3    Rahul   40      M
4  Sarthak   45      M

In [115]:
d.rename(columns={'Name':"Names"})

     Names  Age Gender  Marks
0    Vikas   23      M     90
1   Muskan   30      F     80
2    Sagar   35      M     70
3    Rahul   40      M     89
4  Sarthak   45      M     80

In [116]:
d.groupby("Gender")["Age"].mean()

Gender
F    30.00
M    35.75
Name: Age, dtype: float64

In [117]:
print("The End")

The End